Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རང་བཞིན་གྱིས་རྣམ་པར་དག་པར་སྦྱོར་བ་དང་། རྣམ་པར་ཤེས་པ་རང་བཞིན་གྱིས་རྣམ་པར་དག་པར་ཡང་རློམ་སེམས་མི་བྱེད་པ་འདི་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Likewise, it is to apply oneself to the inherent purity of sensation, ideation, formations, and consciousness and to apply oneself to the inherent purity of these without thought.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་ཁམས་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་སྦྱོར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དང་། སྐྱེ་མཆེད་རྣམས་ལ་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་དུ་སྦྱོར་བ་དང་། རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ལ་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “Moreover, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to the elements as the realm of phenomena and to apply oneself to the realm of phenomena without thought, to apply oneself to the sense sources as being inherently emptiness and to apply oneself to that inherent emptiness without thought.

source: །ཆོས་ཐམས་ཅད་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་སྦྱོར་བ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་བརྟག་པ་ལ་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་ལ་གནས་མེད་པར་སྦྱོར་བ་དང་། གནས་མེད་པར་ཡང་མངོན་པར་ཞེན་པ་མེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་དུ་སྦྱོར་བ་དང་། དེ་བཞིན་ཉིད་དུ་ཡང་མངོན་པར་ཞེན་པ་མེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པའི་མཐའ་ལ་གནས་པར་སྦྱོར་བ་དང་། ཡང་དག་པའི་མཐའ་ལ་གནས་པར་ཡང་རློམ་སེམས་མི་བྱེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: To apply oneself to this dhāraṇī is to apply oneself to all phenomena as dependent origination and to apply oneself to imputed dependent origination without thought, to apply oneself to all phenomena as being nonabiding and to apply oneself without clinging to that nonabiding, to apply oneself to all phenomena as thusness and to apply oneself without clinging to thusness, to apply oneself to all phenomena as situated in the limit of reality and to apply oneself to that limit of reality without thought.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་སེམས་ཅན་འདོད་ཆགས་སྤྱོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པའི་སྦྱོར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་འདོད་ཆགས་ཀྱི་སྤྱོད་པ་དང་། ཀུན་དུ་སྦྱོར་བ་ཡང་མེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “Moreover, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to the understanding of the attachment of beings who indulge in attachment and to apply oneself to the realm of phenomena without attachment or binding ties.

source: །དེ་བཞིན་དུ་སེམས་ཅན་ཞེ་སྡང་སྤྱོད་པ་རྣམས་ཀྱི་ཞེ་སྡང་གི་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པའི་སྦྱོར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཞེ་སྡང་གི་སྤྱོད་པ་དང་། ཀུན་དུ་སྦྱོར་བ་ཡང་མེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: To apply oneself to this dhāraṇī is to apply oneself to the understanding of the aggression of beings who indulge in aggression and to apply oneself to the realm of phenomena without aggression or binding ties.

source: །སེམས་ཅན་གཏི་མུག་སྤྱོད་པ་རྣམས་ཀྱི་གཏི་མུག་གི་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པའི་སྦྱོར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་གཏི་མུག་གི་སྤྱོད་པ་དང་། ཀུན་དུ་སྦྱོར་བ་ཡང་མེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: “Moreover, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to the understanding of the delusion of beings who indulge in delusion and to apply oneself to the realm of phenomena without delusion or binding ties.

source: །སེམས་ཅན་ཆ་མཉམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་ཆ་མཉམ་པའི་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པའི་སྦྱོར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་ཆ་མཉམ་པ་ཆད་པ་ཡང་མེད་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: Moreover, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to the understanding of the mixed afflictions of beings who indulge in the afflictions equally and to apply oneself to the realm of phenomena without a discontinuation of mixed afflictions.

source: །ཀླུའི་བདག་པོ་མདོར་བསྡུ་ན་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོངས་སུ་ཤེས་པའི་སྦྱོར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་སྦྱོར་བ་ཡང་མེད་པ་གང་ཡིན་པ་དེ་ནི་གཟུངས་འདི་ལ་སྦྱོར་བ་ཡིན་ནོ།
en: In summary, Nāga Lord, to apply oneself to this dhāraṇī is to apply oneself to the understanding of the eighty-four thousand types of experience without any application within the realm of phenomena.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་སྦྱོར་བ་གང་ཡིན་པ་དང་། མི་སྦྱོར་བ་གང་ཡིན་པའི་ཆོས་གང་ཡང་དེ་ལ་སྦྱོར་བ་ཡང་མེད་མི་སྦྱོར་བ་ཡང་མེད་དོ།
en: “Moreover, Nāga Lord, this is neither applying oneself nor not applying oneself to any phenomena, whether those phenomena entail applying oneself or not applying oneself.

source: སྦྱོར་བ་དེ་ནི་སྣང་བ་ཡང་མ་ཡིན། བརྟགས་པ་ཡང་མ་ཡིན། མཚན་མར་བྱས་པ་ཡང་མ་ཡིན་པའི་ཕྱིར་ཏེ།
en: Because this application is not an appearance, not an imputation, and not something that has marks.

source: དེ་བས་ན་སྦྱོར་བ་དེ་ནི་ཡང་དག་པའི་སྦྱོར་བ་ཡིན་ནོ།
en: Therefore, this application is the application of reality.

source: །ཡང་དག་པའི་སྦྱོར་བ་ཡང་ཆོས་གང་ཡང་འདྲེན་པར་ཡང་མི་བྱེད། མི་འདྲེན་པར་ཡང་མི་བྱེད། འཛིན་པར་ཡང་མི་བྱེད། གཏོང་བར་ཡང་མི་བྱེད། གནས་པར་ཡང་མི་བྱེད། འགྲོ་བར་ཡང་མི་བྱེད་དེ།
en: The application of reality involves neither drawing forth nor not drawing forth, neither holding onto nor casting away, neither staying with nor leaving any phenomena.

source: དེ་བས་ན་སྦྱོར་བ་དེ་ནི་ཡང་དག་པའི་སྦྱོར་བ་ཞེས་བྱའོ།
en: Therefore, this application is termed the application of reality

source: །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སྦྱོར་བ་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ཐོབ་པར་འགྱུར་རོ།
en: Nāga Lord, bodhisattvas that apply themselves in this way will attain this inexhaustible casket dhāraṇī.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: The Blessed One then expressed this in verse:

source: །གང་ཚེ་དེ་ཡིས་གཟུངས་འདི་ཐོབ་གྱུར་ན།
en: “When one attains this dhāraṇī,

source: །དེ་ཡིས་དྲན་དང་བློ་གྲོས་ཡོངས་སུ་དག །མདོ་སྡེ་རྟོགས་པ་ཀུན་གྱི་ཕ་རོལ་ཕྱིན།
en: One will purify mindfulness and intelligence, Come to the furthest reaches of understanding the sūtras,

source: །འགྲོ་བའི་སྐད་དང་སྒྲ་ཡང་རབ་ཏུ་ཤེས།
en: And fathom the sounds and tongues of beings.

source: །འགྲོ་བའི་སེམས་དང་སྤྱོད་པ་ངན་པ་དང་། །བཟང་དང་འབྲིང་གི་རྒྱུ་བ་གང་ཡིན་ཤེས།
en: “One will understand the workings of the thoughts and deeds of beings— Whether base, excellent, or middling.

source: །སྤྱོད་དང་སེམས་ཀྱི་རྒྱུད་རྣམས་ཤེས་ནས་ཀྱང་།
en: Through simply knowing their deeds and minds,

source: །ཇི་ལྟར་འཚམ་པར་ཆོས་ཀྱི་ཚིག་རྣམས་སྟོན།
en: One will teach them the words of Dharma appropriately.

source: །གང་ཚེ་དེ་ནི་གཟུངས་ལ་རབ་མཁས་ན།
en: “When one is learned in this dhāraṇī,

source: །དེ་ནི་རྒྱུ་དང་བྱེད་དང་རྐྱེན་ལ་མཁས།
en: It follows that one is learned in causes, actions, and conditions.

source: །རྟག་དང་ཆད་པར་ལྟ་བར་མི་འགྱུར་ཏེ།
en: One avoids the views of eternalism and nihilism

source: །མཐར་འཛིན་ཐམས་ཅད་རྣམ་པར་སྤངས་པ་ཡིན།
en: And abandons all clinging to extremes.

source: །ཡི་གེ་དང་ནི་ཚིག་རྣམས་འབྱེད་ལ་མཁས།
en: One will be skilled in parsing syllables and words.

source: །སྐད་རྣམས་མང་པོ་དུ་མ་ཐ་དད་ཤེས།
en: One will know many diverse languages

source: །དོན་དང་ཡི་གེ་ལ་ཡང་མཁས་པར་གྱུར།
en: And become learned in their words and meaning.

source: །དེ་ཡི་ལྷ་ཡི་མིག་ཀྱང་དྲི་མེད་འགྱུར།
en: “Such a one will cleanse the divine eye

source: །དེ་ཡི་ལྷ་ཡི་རྣ་བའང་རྣམ་པར་དག །ཤེས་རབ་མཐའ་ཡས་ཕ་རོལ་སེམས་ལ་མཁས།
en: And purify the divine ear. With infinite insight, one clearly perceives others’ minds

source: །འདས་པ་དང་ནི་མ་འོངས་བསྐལ་པ་དྲན།
en: And recalls past and future eons.

source: །དེ་བཞིན་རྫུ་འཕྲུལ་རྐང་པ་ཐོབ་གྱུར་ནས།
en: “Thus, having attained the bases of miraculous absorption,

source: །ཞིང་རྣམས་བྱེ་བ་མཐའ་ཡས་སྐད་ཅིག་འགྲོ།
en: In a moment one can travel to billions of buddha realms,

source: །འཇིག་རྟེན་འདྲེན་རྣམས་ལ་ནི་མཆོད་པ་བྱེད།
en: Where one will venerate the guides of the world.

source: །དེ་བཞིན་གཟུངས་ལ་ཐོས་པས་ཆོས་ཀྱང་འཛིན།
en: Hearing this dhāraṇī, one will uphold the Dharma.

source: །བདུད་རྣམས་འབུམ་ཕྲག་ཇི་སྙེད་ཡོད་པ་ཡིས།
en: “None of the millions of māras

source: །དེ་ཡི་འགྲོ་བའི་ཡུལ་རྣམས་མི་ཤེས་ལ།
en: Will capture the domain of such beings.

source: །མུན་བསལ་སེམས་ཅན་དག་པ་ཉོན་མོངས་མེད།
en: Eliminating darkness, one will teach

source: །མདོ་སྡེ་སྟོང་ཕྲག་ཚད་མེད་སྟོན་པར་བྱེད།
en: Countless thousands of sūtras to unafflicted beings.

source: །ཆུ་ཡི་ནང་ན་པད་མོ་མ་གོས་བཞིན།
en: “Just as a lotus grows from the water yet remains unsullied,

source: །དེ་ནི་འཇིག་རྟེན་ཆོས་རྣམས་གོས་མེད་སྤྱོད།
en: So one will engage in worldly phenomena yet remain unsullied.

source: །རྗེས་ཆགས་ཁོང་ཁྲོ་རྣམས་ལས་རྟག་ཏུ་གྲོལ།
en: Constantly liberating attachment and anger,

source: །འཇིག་རྟེན་ཀུན་ལ་སེམས་ནི་མཁའ་ལྟར་སྙོམས།
en: All worlds will be equalized in one’s mind, like space.

source: །མཚན་གྱི་དམ་པ་གཟུགས་འཆང་དག་པ་སྟེ།
en: “Possessing the pure body of sublime characteristics,

source: །དེ་ལ་ལྟ་བས་སྐྱེ་བོ་ཆོག་མི་ཤེས།
en: Beings will never tire of beholding one.

source: །སྤྱོད་ལམ་དང་ནི་སྤྱོད་པ་ཤེས་བཞིན་རྒྱུ།
en: One will act according to the understanding of deportment and action,

source: །འགྲོ་ལ་ཕན་དོན་བྱེད་ཅིང་འཇིག་རྟེན་རྒྱུ།
en: Doing what is beneficial for beings and moving the world.

source: །གང་ཚེ་གཟུངས་འདི་ཐོབ་པར་གྱུར་པ་ན།
en: “When one attains this dhāraṇī,

source: །བརྒྱ་བྱིན་དེ་བཞིན་ཚངས་པ་འཇིག་རྟེན་སྐྱོང་།
en: Śakra, Brahmā, and other world protectors

source: །དེ་ཡི་རྐང་མཐིལ་དུ་ནི་གུས་པར་འདུད།
en: Will bow respectfully at one’s feet.

source: །འོན་ཀྱང་དེ་ཡིད་གང་དུའང་ཁེངས་པ་མེད།
en: Yet, one’s pride will not become at all inflated.

source: །དེ་ནི་སྐད་སྙན་ཚངས་པའི་དབྱངས་དང་ལྡན།
en: “One’s melodious voice will rival that of Brahmā

source: །སྐྱེ་བའི་ཡིད་ནི་རྣམ་སྤྱོད་མགུ་བར་བྱེད།
en: And be pleasing to beings.

source: །སྐྱོན་མེད་སྙན་ཅིང་དག་ལ་དུས་སུ་སྨྲ།
en: Flawless, sonorous, pure, and timely,

source: །དེ་ཡི་བསྟན་པ་དོན་མེད་ཡང་མི་འགྱུར།
en: One’s teachings will never be meaningless.

source: །གང་ཚེ་དེ་ཡིས་གཟུངས་ནི་ཐོབ་གྱུར་ན།
en: “When one attains this dhāraṇī,

source: །དེ་ནི་འཁོར་གྱི་ནང་དུ་འཇིགས་པ་མེད།
en: No one in the assembly will be afraid.

source: །སེང་གེའི་སྒྲ་ཅན་མི་འཇིགས་སྒྲོགས་པར་བྱེད།
en: Thundering with the fearless lion’s roar,

source: །ཕ་རོལ་ཚོགས་རྣམས་ཐམས་ཅད་རབ་ཏུ་འཇོམས།
en: All opposing throngs will be defeated.

source: །སེམས་ཅན་གཡོ་ཅན་གདུལ་དཀའ་ང་རྒྱལ་ཁེངས།
en: “Deceptive, recalcitrant, haughty,

source: །མངོན་པའི་ང་རྒྱལ་སྐྱོན་ལྡན་གང་ཡིན་པ།
en: Especially proud, and faulty beings

source: །དེ་དག་མཁས་པའི་ཆོས་ནི་ཐོབ་གྱུར་ན།
en: Who attain this learned Dharma

source: །ང་རྒྱལ་སྤངས་ནས་རྐང་མཐིལ་འདུད་པར་བྱེད།
en: Will abandon such pride and bow to one’s feet.

source: །ཆོས་ཀྱི་དབྱིངས་ནི་རང་བཞིན་ཞི་བ་དང་། །དོན་རྟོགས་དང་ནི་ཆོས་ཉིད་ངེས་པར་ཤེས།
en: “One will realize the truth that the realm of phenomena’s nature is peace And gain conviction in reality.

source: །དེ་ཕྱིར་ཆོས་ནི་གཏན་ལ་འབེབས་པ་དང་། །ཡི་གེ་འབྱེད་ལ་དེ་ཡི་ཚིག་མི་ཟད།
en: Thus, in ascertaining the Dharma And discerning syllables, one’s words are inexhaustible.

source: །སེམས་ཅན་རང་བཞིན་རྣམ་དག་ཆོས་ཀྱི་དབྱིངས།
en: “Beings’ nature is purity—the realm of phenomena.

source: །དེ་བཞིན་བདག་ཉིད་རྣམ་དག་དེ་ཡིས་ཤེས།
en: Pure beings understand this accordingly.

source: །དེ་ལྟར་སེམས་ཅན་དེ་བཞིན་ཉིད་ཤེས་པས།
en: When beings likewise understand this truth,

source: །དེ་ཡི་ཆོས་རྣམས་བསྟན་པ་ཐོགས་པ་མེད།
en: The teachings they give will be unobstructed.

source: །ཟད་པ་ནམ་ཡང་ཟད་པར་མི་ནུས་ལ།
en: “What is exhaustible can never be exhausted.

source: །མི་ཟད་པ་ཡང་ནམས་ཀྱང་ཟད་མི་འགྱུར།
en: What is inexhaustible will also never be exhausted.

source: །ཆོས་ཉིད་རབ་ཞི་འདི་ནི་རྟོགས་ནས་ཀྱང་།
en: By realizing this peaceful reality,

source: །དེར་ནི་མདོ་སྡེ་བྱེ་བ་མཐའ་ཡས་སྟོན།
en: One can teach countless millions of sūtras.

source: །ཡི་གེ་འདི་དག་ལུས་ལ་མི་གནས་ཤིང་།
en: “These words do not abide in the body,

source: །ཡིད་ལ་མི་གནས་སེམས་ལས་མ་བྱུང་སྟེ།
en: Nor do they abide in the mind or arise from mind.

source: །ཇི་ལྟར་བྲག་ཅའི་སྒྲ་ནི་ཐོས་པ་བཞིན།
en: Still, in the same way that an echo can be heard,

source: །ཡི་གེ་རྣམས་ཀྱི་རང་བཞིན་སྟོང་ཞིང་དབེན།
en: The nature of these words is empty and void.

source: །གཟུངས་འདི་ཡི་གེ་རྣམས་དང་སྒྲ་ལ་མེད།
en: “This dhāraṇī exists neither in syllables nor in sounds,

source: །ཚིག་གི་ལམ་དང་ལུས་དང་ངག་ལའང་མེད།
en: Nor in the ways of words, nor in body or speech.

source: །དེ་ལྟར་ཡི་གེའི་ཚུལ་རྣམས་རྟོགས་པས་ན།
en: Because one realizes the reality of syllables in this way,

source: །སྨྲས་ཀྱང་དེ་ཡི་ཚིག་ནི་ཐོགས་པ་མེད།
en: One can voice them, and one’s words will find no impediment.

source: །དེ་ནི་སྟོན་ཀྱང་ཡིད་ལ་རྣམ་རྟོག་མེད།
en: “Though one teaches this, in one’s mind there are no concepts,

source: །སེམས་ལའང་རློམ་སེམས་བྱེད་པ་ཡང་མེད་དེ།
en: No thinking in the mind either.

source: །འོན་ཀྱང་ཆོས་འདི་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: However, because this Dharma must be realized,

source: །ཆོས་ཉིད་རབ་ཏུ་འཐད་པའི་ཆོས་ཀྱང་སྟོན།
en: One teaches a Dharma that accords with reality.

source: །སོ་སོ་ཡང་དག་རིག་བཞི་རྗེས་སུ་རྟོགས།
en: One realizes the four correct discriminations.

source: །དོན་ལ་རབ་བསླབས་ཆོས་ཉིད་ཆོ་ག་ཤེས།
en: Training in the truth, one knows the activity of reality

source: །སྒྲ་དང་སྐད་དང་ངེས་པའི་ཚིག་ལ་མཁས།
en: And becomes learned in sound, language, and etymology.

source: །དེ་བཞིན་སྤོབས་པ་ཐོགས་མེད་ཚད་ཀྱང་མེད།
en: “Thereby, one’s eloquence is unimpeded and has no limit,

source: །དེ་ནི་ཀུན་རྫོབ་དོན་དམ་ཤེས་པ་སྟེ།
en: And one realizes relative and ultimate truth.

source: །དེ་བཞིན་སྣ་ཚོགས་ཟབ་མོ་བསྟན་པ་ཤེས།
en: Thereby, one understands various profound teachings

source: །ལུགས་འབྱུང་ལུགས་ལས་བཟློག་པའང་རབ་ཏུ་ཤེས།
en: In their forward and reverse progression.

source: །མཐོ་དམན་འགྲོ་བ་རྣམས་ལའང་ཕ་མཐར་ཕྱིན།
en: “Beings high and low will reach the far shore.

source: །སེམས་ཞུམ་པ་ན་རབ་ཏུ་འཛིན་ལ་མཁས།
en: One will be skilled in supporting those with daunted minds,

source: །དེ་བཞིན་ཁེངས་རྣམས་ཚར་གཅོད་ཤེས་ལ་མཁས།
en: And likewise skilled in defeating the haughty.

source: །བསྟན་པ་དག་ལ་བྱ་བའི་ཚུལ་ཀུན་ཤེས།
en: One knows the full scope of what teachings may be needed. “An unimpeded knowledge penetrates

source: །ལུས་དང་ངག་དང་སེམས་ཀྱི་ལས་རྣམས་ལ།
en: The actions of body, speech, and mind.

source: །ཤེས་པ་ཐོགས་མེད་རྣམ་པར་ངེས་པར་འཇུག །གཟུངས་དང་ལྡན་པའི་ཚིག་ལ་འཁྲུལ་པ་མེད།
en: Confusion regarding words containing dhāraṇīs will disappear,

source: །ཉེས་པ་སྤངས་ཤིང་བརྟན་པོར་གྱུར་པ་ཡིན།
en: One will relinquish faults and become stable.

source: །སེམས་ཅན་འདུལ་གཟུངས་ཡིད་དང་དྲན་པ་ལ།
en: “Recollecting the dhāraṇī that guides beings

source: །ཞུགས་པར་གྱུར་ན་ཆོས་ཞེས་ཞུགས་པ་སྟེ།
en: Is to enter the so-called Dharma.

source: །ཐོས་པ་གང་ཡིན་ནམས་ཀྱང་ཆུད་མི་ཟ།
en: Nothing whatsoever that one hears will go to waste.

source: །ཇི་སྐད་ཐོས་པ་མཚུངས་པར་རིལ་གྱིས་འཛིན།
en: Whatever one hears will be fully mastered accordingly.

source: །གཟུངས་ནི་ཆོས་ཉིད་འགལ་བ་མ་ཡིན་ལ།
en: “This dhāraṇī does not contradict reality.

source: །དེ་ནི་ཆོས་ལའང་ཞི་བ་མ་ཡིན་ཏེ།
en: It is not peace, even regarding the Dharma.

source: །ཆོས་དང་ཤིན་ཏུ་མི་མཚུངས་མི་མཉམ་མཉམ།
en: It is not like the Dharma, but unequaled.

source: །ཆོས་ཉིད་སྦྱོར་དང་ལྡན་ཕྱིར་གཟོད་ནས་ཞི།
en: Because it is connected with reality, it is primordial peace.”

source: །མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་སྦྱོར་བ་འདི་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་མངོན་པར་སྒྲུབ་པ་འདི་བསྟན་པ་ན། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་འཁོར་གྱི་ནང་ནས་ཀླུ་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: When the Blessed One taught the application of the inexhaustible casket dhāraṇī and this selection of verses, twelve thousand nāgas of the Nāga King Sāgara’s retinue developed the mind set on unsurpassed and perfect awakening.

source: དེ་དག་གིས་ཚིག་འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་མ་འོངས་པའི་དུས་ན། མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ཐོབ་ནས་ཇི་ལྟར་ད་ལྟར་ན། དེ་བཞིན་གཤེགས་པའི་ཆོས་སྟོན་པ་དེ་ཁོ་ན་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་སྟོན་པར་གྱུར་ཅིག་ཅེས་ཀྱང་སྨྲས་སོ།
en: They aspired, “Blessed One, in the future, may we achieve the inexhaustible casket dhāraṇī and teach the Dharma to all beings exactly and exclusively as the Thus-Gone One has taught the Dharma here and now.”

source: །མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ཕན་ཡོན་གྱི་ལེའུ་སྟེ་བཞི་པའོ།།
en: Chapter Four: The Benefits of the Inexhaustible Casket Dhāraṇī

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀླུའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་དག་ཀྱང་འདི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིད་ལ། འདི་ན་མིར་གྱུར་པ་ཁ་ཅིག་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་རྔོ་མི་ཐོགས་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: Venerable Śāriputra then said to the Blessed One, “Blessed One, if even beings born into the nāga realms can develop the mind set on unsurpassed and perfect awakening in this fashion, it is astounding that some people are incapable of developing the mind set on awakening.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཀླུ་ཁྲི་ཉིས་སྟོང་བོ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ།
en: The Blessed One responded, “Śāriputra, these twelve thousand nāgas went forth in the Thus-Gone One Kāśyapa’s body of teachings.

source: འདི་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་ལས་བྱང་ཆུབ་ཀྱི་སེམས་དང་ལྡན་པའི་གཏམ་ཅིག་ཐོས་སོ།
en: They heard the message on the mind set on awakening from that thus-gone one.

source: །ཐོས་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ།
en: Not only did they hear it, but the Thus-Gone One gave them his approval.

source: ཐེག་པ་ཆེན་པོ་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། ལེགས་སོ་ལེགས་སོ་ཞེས་ཚིག་ཏུ་སྨྲས་སོ།
en: The Great Vehicle is inconceivable, and yet he expressed his approval.

source: །མི་དགེ་བའི་འདུ་འཛི་འདི་ལྟ་སྟེ།
en: Still, they were distracted by nonvirtue in the following way:

source: མཛའ་བཤེས་ཀྱི་ཁྱིམ་དང་། སློང་མོ་སྟེར་བའི་ཁྱིམ་ཡོངས་སུ་བཟུང་བའི་ཕྱིར་ཚུལ་ཁྲིམས་རྣམས་ཉམས་སུ་མ་བླངས་པར་གྱུར་ཏེ།
en: in order to keep a family household or a household that gives to beggars, they failed to practice discipline.

source: ཚུལ་ཁྲིམས་ཉམས་པར་བྱས་པ་དེ་ན་འདི་དག་དེ་ནས་ཤི་འཕོས་ནས་ཀླུའི་སྐྱེ་གནས་སུ་སྐྱེས་པར་གྱུར་ཏོ།
en: As they let their discipline become impaired, once they died, they were reborn in the nāga realm.

source: །འདི་དག་གི་ཐེག་པ་ཆེན་པོའི་གཏམ་དེ་ཐོས་ལ། བཅོམ་ལྡན་འདས་དེ་ལ་ཡང་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་བའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དང་དགེ་བའི་རྩ་བ་དེས་ནི་ད་ལྟར་ང་ལས་ཐེག་པ་ཆེན་པོའི་གཏམ་ཐོས་ཏེ།
en: Through the cause, contributing condition, and roots of virtue of them hearing the message of the Great Vehicle and the Blessed One expressing his approval, they now hear the Great Vehicle message from me.

source: མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་བསྟན་པ་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: Having heard teachings on the inexhaustible casket dhāraṇī, they are developing the mind set on unsurpassed and perfect awakening.

source: །ཤཱ་རིའི་བུ་ལྷག་པའི་བསམ་པའི་ཁྱད་པར་ལ་ལྟོས།
en: Śāriputra, just consider this difference of intention.

source: ངས་འདི་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏེ།
en: “I will now give them their prophecy of unsurpassed and perfect awakening:

source: བསྐལ་པ་བགྲང་བ་ལས་འདས་པ་དག་ན་དེ་བཞིན་གཤེགས་པ་ཡང་བགྲང་བ་ལས་འདས་པ་དག་ལ་མཆོད་པ་བྱས་ནས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་འཐུན་པའི་ཆོས་རྣམས་ཡང་དག་པར་བསྒྲུབས་ཏེ།
en: after countless eons of serving countless thus-gone ones, they will truly accomplish the Dharma that accords with awakening.

source: བསྐལ་པ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པའི་སྙིང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Then, during the Joyful Eon in the world called Immaculate Heart, they will fully awaken to unsurpassed and perfect buddhahood.

source: ཡེ་ཤེས་བླ་མ་ཞེས་བྱ་བ་དང་། བསོད་ནམས་བླ་མ་ཞེས་བྱ་བ་དང་། ཆོས་བླ་མ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་བླ་མ་ཞེས་བྱ་བའི་མཚན་འདི་བཞིར་འཐུན་པར་ཤ་སྟག་གི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ།
en: They will all become thus-gone ones with four appropriate names: Superior Wisdom, Superior Merit, Superior Dharma, and Superior Insight.

source: །དེ་དག་ཐམས་ཅད་ཀྱང་བསྐལ་པ་གཅིག་ཁོ་ན་ལ་འབྱུང་བར་འགྱུར་ཏེ། དཔེར་ན་བསྐལ་པ་བཟང་པོ་འདི་ལ་སངས་རྒྱས་སྟོང་འབྱུང་བར་འགྱུར་བ་བཞིན་ནོ།
en: They will all appear during a single eon, just as now a thousand buddhas are set to appear during this Fortunate Eon.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་བསྐལ་པའི་དང་པོར་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་གནས་པ་དང་། གང་གི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་འཇིག་རྟེན་དུ་བྱུང་བ་དེའི་ཚེ་ནི་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཀླུ་དང་། ཀླུའི་བུ་དང་། ཀླུའི་བུ་མོ་དག་ཉུང་བར་གྱུར་ཏེ།
en: Then Nāga King Sāgara said to the Blessed One, “Blessed One, when I was living in the ocean at the beginning of the eon, when the Blessed Thus-Gone One Krakucchanda appeared in the world, there were only a few adult nāgas and young male and female nāgas in that ocean.

source: བདག་ཀྱང་འཁོར་ཉུང་བར་གྱུར།
en: Even I had a meager retinue.

source: བཅོམ་ལྡན་འདས་ང་ནི་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཀླུ་དང་། ཀླུའི་བུ་དང་། ཀླུའི་བུ་མོ་དག་ཀྱང་འདི་ལྟར་ཚད་མ་མཆིས་ཏེ།
en: Now, Blessed One, the adult nāgas and young male and female nāgas in the ocean are limitless.

source: གྲངས་ཀྱིས་མཐའ་རྟོགས་པར་མི་ནུས་ལགས་ན།
en: Their limit cannot be calculated numerically.

source: བཅོམ་ལྡན་འདས་འདི་ལ་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས།
en: Blessed One, what is the cause and contributing condition for this?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་གང་དག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་ནས་ཚུལ་ཁྲིམས་དག་ལ་ཡོངས་སུ་རྫོགས་པར་མ་བྱས་ཏེ། ཆོ་ག་ཉམས་པ་དང་། འཚོ་བ་ཉམས་པ་དང་། ཚུལ་ཁྲིམས་ཉམས་པ་དང་། ཡོངས་སུ་རྫོགས་པར་མ་བྱས་ལ་དེ་དག་གི་ལྟ་བ་ཡང་དྲང་པོར་གྱུར་ཏེ།
en: The Blessed One answered, “Nāga Lord, those who go forth in the well-spoken Dharma and Vinaya and do not perfect their discipline—who do not perfect it but rather let their activities, livelihood, and discipline degenerate, though they still have a morally upright view—are not reborn as hell beings.

source: དེས་ན་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་ནི་མི་སྐྱེའི་ཤི་འཕོས་ནས་ཀླུའི་སྐྱེ་གནས་རྣམས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Once they die, they will be reborn in the nāga realms.

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གི་གསུང་རབ་ལས་ནི་སྲོག་ཆགས་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་ཆོ་ག་དང་། འཚོ་བ་དང་། ཚུལ་ཁྲིམས་ཉམས་ཏེ།
en: Nāga Lord, 980 million householders and monastics let the activities, livelihood, and discipline received from the Thus-Gone One Krakucchanda’s teachings degenerate.

source: ཤི་འཕོས་ནས་ཀླུའི་སྐྱེ་གནས་རྣམས་སུ་སྐྱེས་སོ།
en: Once they died, they were reborn in the nāga realms.

source: །དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་ཀྱི་གསུང་རབ་ལས་ནི་སྲོག་ཆགས་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་རབ་ཏུ་བྱུང་བ་ལས་ཚུལ་ཁྲིམས་འཆལ་པར་གྱུར་པས་ཤི་འཕོས་ཏེ།
en: Also, 640 million householders and monastics who went forth in the Thus-Gone One Kanakamuni’s teachings subsequently let their discipline become corrupt.

source: ཀླུ་རྣམས་ཀྱི་སྐྱེ་གནས་སུ་སྐྱེས་སོ།
en: Thus, when they died, they were reborn in the nāga realms.

source: །དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་གི་གསུང་རབ་ལས་ནི་སྲོག་ཆགས་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ཆོ་ག་དང་། འཚོ་བ་དང་། ཚུལ་ཁྲིམས་ཉམས་ཏེ།
en: Likewise, 800 million householders and monastics let their activities, livelihood, and discipline that they received from the Thus-Gone One Kāśyapa degenerate.

source: །ཀླུའི་བདག་པོ་ད་ལྟར་ངའི་གསུང་རབ་འདི་ལས་ནི་སྲོག་ཆགས་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་རབ་ཏུ་བྱུང་བ་ལས་རྩོད་པ་སྣ་ཚོགས་དང་། འཐབ་པ་སྣ་ཚོགས་དང་། འདུ་འཛི་སྣ་ཚོགས་ཀྱི་ཆོ་ག་དང་། འཚོ་བ་དང་། ཚུལ་ཁྲིམས་ཉམས་ཏེ།
en: Nāga King, presently 999 million householders and monastics who have gone forth in my teachings have subsequently gotten involved in various debates, struggles, and distractions and let their activities, livelihood, and discipline degenerate.

source: ཤི་འཕོས་ནས་ཀླུའི་སྐྱེ་གནས་རྣམས་སུ་སྐྱེ་ཞིང་སྐྱེ་བར་འགྱུར་ཏེ།
en: When they die, they will also be reborn in the nāga realms.

source: ཀླུའི་བདག་པོ་རྒྱུ་ནི་དེ་ཡིན་ནོ།
en: “Nāga Lord, such are the causes.

source: །རྐྱེན་ནི་དེ་ཡིན་ཏེ།
en: Such are the conditions.

source: དེས་ནད་ལྟར་ཀླུ་དང་། ཀླུའི་བུ་དང་། ཀླུའི་བུ་མོ་རྣམས་དེ་ལྟར་ཚད་མེད་དོ།
en: Therefore, the population of adult nāgas and young male and female nāgas is presently limitless in this way.
